"""
Задание 1.

Создать класс TrafficLight (светофор)
и определить у него один приватный атрибут color (цвет) и публичный метод running (запуск).

В рамках метода running реализовать переключение светофора в режимы:
красный, желтый, зеленый. Продолжительность первого состояния (красный)
составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый) —
на ваше усмотрение.
Для имитации "горения" каждого цвета испольщуйте ф-цию sleep модуля time

Переключение между режимами должно осуществляться только
в указанном порядке (красный, желтый, зеленый).

Проверить работу примера, создав экземпляр и вызвав описанный метод.
"""
import time


class TrafficLight:
    __colour = "red"

    def running(self):
        while True:
            self.__colour = "red"
            print("red")
            time.sleep(7)
            self.__colour = "yellow"
            print("yellow")
            time.sleep(2)
            self.__colour= "green"
            print("green")
            time.sleep(9)


trafficlight_1 = TrafficLight()

trafficlight_1.running()