'''
    Вычислить число c заданной точностью d

    Пример:

- при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$
'''
d = input("Введите число точности")
n = 10 / 3
if float(d) < 1:
    g = len(d) - 2
else:
    g = int(d)
print(format(n, f".{g}f"))
